{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"arguments": {}, "output_shape": [16, 32, 3], "name": "lambda_4", "output_shape_type": "raw", "batch_input_shape": [null, 16, 32, 3], "trainable": true, "input_dtype": "float32", "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-31-8f09a308686b>\u00da\b<lambda>\u0007\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "border_mode": "same", "trainable": true, "init": "glorot_uniform", "b_constraint": null, "bias": true, "nb_row": 8, "W_constraint": null, "dim_ordering": "tf", "b_regularizer": null, "nb_filter": 16, "name": "convolution2d_13", "nb_col": 8, "subsample": [4, 4], "W_regularizer": null, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_16", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "border_mode": "same", "trainable": true, "init": "glorot_uniform", "b_constraint": null, "bias": true, "nb_row": 5, "W_constraint": null, "dim_ordering": "tf", "b_regularizer": null, "nb_filter": 32, "name": "convolution2d_14", "nb_col": 5, "subsample": [2, 2], "W_regularizer": null, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_17", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "border_mode": "same", "trainable": true, "init": "glorot_uniform", "b_constraint": null, "bias": true, "nb_row": 5, "W_constraint": null, "dim_ordering": "tf", "b_regularizer": null, "nb_filter": 64, "name": "convolution2d_15", "nb_col": 5, "subsample": [2, 2], "W_regularizer": null, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_18", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "border_mode": "same", "trainable": true, "init": "glorot_uniform", "b_constraint": null, "bias": true, "nb_row": 5, "W_constraint": null, "dim_ordering": "tf", "b_regularizer": null, "nb_filter": 128, "name": "convolution2d_16", "nb_col": 5, "subsample": [2, 2], "W_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_10", "trainable": true, "p": 0.5}}, {"class_name": "Flatten", "config": {"name": "flatten_4", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_11", "trainable": true, "p": 0.5}}, {"class_name": "ELU", "config": {"name": "elu_19", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"output_dim": 512, "b_constraint": null, "init": "glorot_uniform", "trainable": true, "bias": true, "activation": "linear", "W_constraint": null, "input_dim": 128, "b_regularizer": null, "name": "dense_7", "W_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_12", "trainable": true, "p": 0.2}}, {"class_name": "ELU", "config": {"name": "elu_20", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"output_dim": 1, "b_constraint": null, "init": "glorot_uniform", "trainable": true, "bias": true, "activation": "linear", "W_constraint": null, "input_dim": 512, "b_regularizer": null, "name": "dense_8", "W_regularizer": null, "activity_regularizer": null}}]}